slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Gr8 K8s with Haskell</title>
<meta name="author" content="Akshay Mankar"/>
<link rel="stylesheet" href="file:///Users/axeman/work/reveal.js-3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="file:///Users/axeman/work/reveal.js-3.8.0/css/theme/blood.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Gr8 K8s with Haskell</h1>
</section>
<style>.reveal h1, .reveal h2, .reveal h3, .reveal h4 {text-transform: none;}</style>
<section>
<section id="slide-orgfe4c757">
<h2 id="orgfe4c757">Hello</h2>
<div class="outline-text-2" id="text-orgfe4c757">
</div>
</section>
<section id="slide-org24b623f">
<h3 id="org24b623f">My Name is Akshay</h3>
<ul>
<li>Software Engineer, Pivotal</li>
<li>Project Eirini
<ul>
<li>Get CF apps running on K8s</li>
<li><a href="http://eirini.cf">http://eirini.cf</a></li>

</ul></li>

</ul>
</section>
<section id="slide-org78ebdbd">
<h3 id="org78ebdbd">Not a fan of golang</h3>
<div class="org-src-container">

<pre  class="src src-go"><span style="color: #51afef;">if</span> err != <span style="color: #a9a1e1;">nil</span> <span style="color: #51afef;">{</span>
    <span style="color: #c678dd;">panic</span><span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">}</span>
</pre>
</div>
</section>
<section id="slide-org6a5b775">
<h3 id="org6a5b775">Noob Alert</h3>
<ul>
<li>I've been writing haskell on my own</li>
<li>Let me know if I say wrong things</li>

</ul>
</section>
</section>
<section>
<section id="slide-org4ff5742">
<h2 id="org4ff5742">So Haskell, How?</h2>
<div class="outline-text-2" id="text-org4ff5742">
</div>
</section>
<section id="slide-orge62a2f5">
<h3 id="orge62a2f5">OpenAPI/Swagger</h3>
<ul>
<li class="fragment roll-in">Kubernetes exports openapi/swagger spec</li>
<li class="fragment roll-in">There is an OpenAPI code generator for haskell</li>
<li class="fragment roll-in">So, the haskell client is generated</li>

</ul>
</section>
<section id="slide-orge52f8f9">
<h3 id="orge52f8f9">Generated code is not all</h3>
<ul>
<li>There is also a client library to
<ul>
<li>Load kubeconfig</li>
<li>Authenticate with OIDC and GCP</li>
<li>Watch K8s resources</li>
<li>Potentially more</li>

</ul></li>

</ul>
</section>
<section id="slide-orgef1daf3">
<h3 id="orgef1daf3">Where is it?</h3>
<ul>
<li>Hackage
<ul>
<li><a href="https://hackage.haskell.org/package/kubernetes-client-core">kubernetes-client-core</a>: Generated Code</li>
<li><a href="https://hackage.haskell.org/package/kubernetes-client">kubernetes-client</a>: Manually written library</li>

</ul></li>
<li>Github: <a href="https://github.com/kubernetes-client/haskell">kubernetes-client/haskell</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org39c529e">
<h2 id="org39c529e">Examples</h2>
<div class="outline-text-2" id="text-org39c529e">
</div>
</section>
<section id="slide-org9953f97">
<h3 id="org9953f97">Simple Example</h3>
<ul>
<li>List Pods in a namespace</li>
<li>Print all their names</li>

</ul>
</section>
<section id="slide-org4080472">
<h3 id="org4080472">Haskell</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><span class="linenr"> 1: </span><span style="color: #c678dd;">main</span> <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span>
<span class="linenr"> 2: </span>  oidcCache <span style="color: #dcaeea;">&lt;-</span> newTVarIO <span style="color: #dcaeea;">$</span> fromList <span style="color: #51afef;">[]</span>
<span class="linenr"> 3: </span>  <span style="color: #51afef;">(</span>mgr, cfg<span style="color: #51afef;">)</span> <span style="color: #dcaeea;">&lt;-</span> kubeClient oidcCache
<span class="linenr"> 4: </span>                <span style="color: #dcaeea;">$</span> <span style="color: #ECBE7B;">KubeConfigFile</span> <span style="color: #98be65;">"/path/to/kube/config"</span>
<span class="linenr"> 5: </span>  program mgr cfg
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #c678dd;">program</span> mgr cfg <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span>
<span class="linenr"> 8: </span>  podList <span style="color: #dcaeea;">&lt;-</span> listNamespacedPod <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Accept</span> <span style="color: #ECBE7B;">MimeJSON</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Namespace</span> <span style="color: #98be65;">"kube-system"</span><span style="color: #51afef;">)</span>
<span class="linenr"> 9: </span>             <span style="color: #dcaeea;">&amp;</span> dispatchMime' mgr cfg
<span class="linenr">10: </span>             <span style="color: #dcaeea;">&amp;</span> <span style="color: #51afef;">(</span><span style="color: #dcaeea;">&gt;&gt;=</span> either throwM pure<span style="color: #51afef;">)</span>
<span class="linenr">11: </span>  mapM_ printPodName <span style="color: #51afef;">(</span>v1PodListItems podList<span style="color: #51afef;">)</span> <span style="color: #51afef;">where</span>
<span class="linenr">12: </span>    printPodName pod <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">case</span> v1ObjectMetaName <span style="color: #dcaeea;">=&lt;&lt;</span> v1PodMetadata pod <span style="color: #51afef;">of</span>
<span class="linenr">13: </span>                         <span style="color: #ECBE7B;">Nothing</span>   <span style="color: #dcaeea;">-&gt;</span> print <span style="color: #98be65;">"Name not found"</span>
<span class="linenr">14: </span>                         <span style="color: #ECBE7B;">Just</span> name <span style="color: #dcaeea;">-&gt;</span> T.putStrLn name
<span class="linenr">15: </span><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Exception</span> <span style="color: #ECBE7B;">MimeError</span>
</pre>
</div>
</section>
<section id="slide-orgdaf1841">
<h3 id="orgdaf1841">Golang</h3>
<div class="org-src-container">

<pre  class="src src-go"><span class="linenr"> 1: </span><span style="color: #51afef;">func</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
<span class="linenr"> 2: </span>  config, err := clientcmd.<span style="color: #c678dd;">BuildConfigFromFlags</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">""</span>, <span style="color: #98be65;">"/path/to/kube/config"</span><span style="color: #c678dd;">)</span>
<span class="linenr"> 3: </span>  <span style="color: #51afef;">if</span> err != <span style="color: #a9a1e1;">nil</span> <span style="color: #c678dd;">{</span> <span style="color: #c678dd;">panic</span><span style="color: #98be65;">(</span>err<span style="color: #98be65;">)</span> <span style="color: #c678dd;">}</span>
<span class="linenr"> 4: </span>  client, err := kubernetes.<span style="color: #c678dd;">NewForConfig</span><span style="color: #c678dd;">(</span>config<span style="color: #c678dd;">)</span>
<span class="linenr"> 5: </span>  <span style="color: #51afef;">if</span> err != <span style="color: #a9a1e1;">nil</span> <span style="color: #c678dd;">{</span> <span style="color: #c678dd;">panic</span><span style="color: #98be65;">(</span>err<span style="color: #98be65;">)</span> <span style="color: #c678dd;">}</span>
<span class="linenr"> 6: </span>  err = <span style="color: #c678dd;">program</span><span style="color: #c678dd;">(</span>client<span style="color: #c678dd;">)</span>
<span class="linenr"> 7: </span>  <span style="color: #51afef;">if</span> err != <span style="color: #a9a1e1;">nil</span> <span style="color: #c678dd;">{</span> <span style="color: #c678dd;">panic</span> <span style="color: #98be65;">(</span>err<span style="color: #98be65;">)</span> <span style="color: #c678dd;">}</span>
<span class="linenr"> 8: </span><span style="color: #51afef;">}</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #51afef;">func</span> <span style="color: #c678dd;">program</span><span style="color: #51afef;">(</span>client <span style="color: #ECBE7B;">kubernetes.Interface</span><span style="color: #51afef;">)</span> <span style="color: #ECBE7B;">error</span> <span style="color: #51afef;">{</span>
<span class="linenr">11: </span>  podList, err := client.<span style="color: #c678dd;">CoreV1</span><span style="color: #c678dd;">()</span>.<span style="color: #c678dd;">Pods</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"kube-system"</span><span style="color: #c678dd;">)</span>.<span style="color: #c678dd;">List</span><span style="color: #c678dd;">(</span>metav1.<span style="color: #ECBE7B;">ListOptions</span><span style="color: #98be65;">{}</span><span style="color: #c678dd;">)</span>
<span class="linenr">12: </span>  <span style="color: #51afef;">if</span> err != <span style="color: #a9a1e1;">nil</span> <span style="color: #c678dd;">{</span> <span style="color: #51afef;">return</span> err <span style="color: #c678dd;">}</span>
<span class="linenr">13: </span>  <span style="color: #51afef;">for</span> _, pod := <span style="color: #51afef;">range</span> podList.Items <span style="color: #c678dd;">{</span>
<span class="linenr">14: </span>    <span style="color: #51afef;">if</span> pod.Name != <span style="color: #98be65;">""</span> <span style="color: #98be65;">{</span>
<span class="linenr">15: </span>      fmt.<span style="color: #c678dd;">Println</span><span style="color: #da8548;">(</span>pod.Name<span style="color: #da8548;">)</span>
<span class="linenr">16: </span>    <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
<span class="linenr">17: </span>      fmt.<span style="color: #c678dd;">Println</span><span style="color: #da8548;">(</span><span style="color: #98be65;">"Name not found"</span><span style="color: #da8548;">)</span>
<span class="linenr">18: </span>    <span style="color: #98be65;">}</span>
<span class="linenr">19: </span>  <span style="color: #c678dd;">}</span>
<span class="linenr">20: </span><span style="color: #51afef;">}</span>
</pre>
</div>
</section>
<section id="slide-org9ff6016">
<h3 id="org9ff6016">Not so simple example</h3>
<ul>
<li class="fragment roll-in">Given
<ul>
<li>User creates <code>Deployments</code> with "k8s-app" label</li>
<li>Each <code>Deployment</code> creates a <code>ReplicaSet</code>, it could be more than 1 sometimes</li>
<li>Each <code>ReplicaSet</code> creates a few <code>Pods</code></li>
<li>Each <code>Pod</code> has an IP address</li>

</ul></li>
<li class="fragment roll-in">Print
<ul>
<li>One line for each deployment with the label and the IP addresses of the associated pods</li>

</ul></li>

</ul>
</section>
<section id="slide-org9174fbd">
<h3 id="org9174fbd">Code</h3>
</section>
</section>
<section>
<section id="slide-org2167759">
<h2 id="org2167759">You can help!</h2>
<ul>
<li class="fragment roll-in">Use it and create issues</li>
<li class="fragment roll-in">Better <a href="https://github.com/openapitools/openapi-generator/">code generator</a></li>
<li class="fragment roll-in">Support for exec and attach to containers</li>
<li class="fragment roll-in">Cached informers</li>
<li class="fragment roll-in">&#x2026;</li>

</ul>
</section>
</section>
<section>
<section id="slide-org2c3a067">
<h2 id="org2c3a067">Thanks!</h2>
</section>
</section>
</div>
</div>
<script src="file:///Users/axeman/work/reveal.js-3.8.0/lib/js/head.min.js"></script>
<script src="file:///Users/axeman/work/reveal.js-3.8.0/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'convex', // see README of reveal.js for options
transitionSpeed: 'default',
hash: true,

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'file:///Users/axeman/work/reveal.js-3.8.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///Users/axeman/work/reveal.js-3.8.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///Users/axeman/work/reveal.js-3.8.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]

});
</script>
</body>
</html>
